
## Plan Result (terraform/aws/tfaction)

[CI link](https://github.com/boxp/arch/actions/runs/12209012196)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.aws.aws_iam_policy.lock_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.terraform_apply_lock_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.terraform_plan_lock_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_lock_terraform_state[0]
  * module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_lock_terraform_state[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.aws.aws_iam_policy.lock_terraform_state[0] will be created
  + resource "aws_iam_policy" "lock_terraform_state" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "GitHubActions_Terraform_AWS_lock_terraform_state"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::tfaction-state/*.tflock"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.aws.aws_iam_role_policy_attachment.terraform_apply_lock_terraform_state[0] will be created
  + resource "aws_iam_role_policy_attachment" "terraform_apply_lock_terraform_state" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_terraform_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.terraform_plan_lock_terraform_state[0] will be created
  + resource "aws_iam_role_policy_attachment" "terraform_plan_lock_terraform_state" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_terraform_plan"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_lock_terraform_state[0] will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_lock_terraform_state" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_lock_terraform_state[0] will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_plan_lock_terraform_state" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_plan"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2407,"Program":"tfcmt","SHA1":"09d31bad17319d4e3fe257646f6439437facb768","Target":"terraform/aws/tfaction","Vars":{},"WorkflowName":"pull_request_target"} -->